{
  "Groceries": {
    "celebrate": [
      {
        "text": "Let's do a meal prep or batch-cook day this week.",
        "mood": "calm",
        "weight": 4
      },
      {
        "text": "Make a pantry-first recipe night - use what you already have!",
        "mood": "tired",
        "weight": 3
      },
      {
        "text": "Grocery shopping can be considered a day out, too! 🙂",
        "mood": "motivated",
        "weight": 4
      },
      {
        "text": "You stuck to your list at the store - that's real discipline! Go you! 🦾",
        "mood": "discouraged",
        "weight": 4
      },
      {
        "text": "You chose store-brand over name-brand and still made it delicious. That's the savvy life! 😎",
        "mood": "motivated",
        "weight": 4
      },
      {
        "text": "Swapped white sugar for brown sugar and saved over $2? That's a sweet budgeting win! 🍯",
        "mood": "motivated",
        "weight": 4
      }
    ],
    "caution": [
      {
        "text": "Let's check for any coupons or cheaper items at the local farmers market this week.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Go grocery shopping with a list prepared beforehand! It will reduce impulse buys or repeat items.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Check unit prices instead of brand names - some deals aren't actually cheaper.",
        "mood": "tired",
        "weight": 3
      },
      {
        "text": "Avoid grocery shopping when you're hungry - it *always* leads to spending more.",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Never be ashamed to visit a local food pantry! That's what they're there for - to assist individuals with grocery costs.",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "Double-check your pantry before heading to the store. You might already have what you need.",
        "mood": "tired",
        "weight": 1
      },
      {
        "text": "It's easy to overspend on `healthy` snacks - try portioning what you already bought before buying more.",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "Double-check the unit price on basics like sugar and flour - sometimes the *fancier* option is actually cheaper.",
        "mood": "tired",
        "weight": 3
      }
    ],
    "alert": [
      {
        "text": "Uber Eats is cool, but those delivery costs can sneak up if you're ordering more than cooking.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "I would highly recommend reviewing your budget for groceries this week to cut costs.",
        "mood": "discouraged",
        "weight": 1
      },
      {
        "text": "Overpaying for staples like sugar and oil? That adds up fast. Let's compare store-brand prices next time.",
        "mood": "calm",
        "weight": 2
      }
    ]
  },
  "Dining": {
    "celebrate": [
      {
        "text": "How about we set a fun cook-at-home challenge tonight? It will pair beautifully with a lo-fi Spotify playlist! 🎧",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Let's swap one delivery for a picnic this week - same treat, half the cost!",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Host a potluck with friends - good food, great company, low cost.",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "You made a homemade version of your favorite takeout? That's a gourmet win! 🍜",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "You passed up fast food and made something at home - that's a strong win!",
        "mood": "motivated",
        "weight": 3
      },
      {
        "text": "You picked a less expensive item on the menu and still had a great time. Yay for balance! 😃",
        "mood": "calm",
        "weight": 4
      }
    ],
    "caution": [
      {
        "text": "Set a max-spend rule for take-out this week and stick to it. 🦾",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Keep track of how many meals you're eating out this week - awareness is a game-changer.",
        "mood": "motivated",
        "weight": 1
      },
      {
        "text": "Apps like Too Good To Go or local food rescue groups can help you grab discounted meals near closing time.",
        "mood": "motivated",
        "weight": 1
      },
      {
        "text": "Remember - there are many other ways to have fun besides dining out at a restaurant or bar. 🙂",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "Dining out solo? Consider a small treat rather than a full meal to keep it special *and* stay on-budget.",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Avoid restaurants or bars when you're overly hungry - you're more likely to over-order and overspend.",
        "mood": "calm",
        "weight": 2
      }
    ],
    "alert": [
      {
        "text": "Do your best to limit dining out, including Happy Hours. Those $5 apps and $7 cocktails add up! 🥂",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Ordering takeout daily can quietly burn a hole in your wallet. Let's aim for just once or twice a week max.",
        "mood": "calm",
        "weight": 1
      },
      {
        "text": "If you're regularly skipping groceries in favor of eating out, you may be trading long-term stability for short-term ease. Let's reset.",
        "mood": "discouraged",
        "weight": 2
      }
    ]
  },
  "Entertainment": {
    "celebrate": [
      {
        "text": "You don't need to spend money to have fun. 🙂",
        "mood": "tired",
        "weight": 4
      },
      {
        "text": "We can make progress on an unfinished game instead of buying new games this month.",
        "mood": "calm",
        "weight": 3
      }
    ],
    "caution": [
      {
        "text": "Browse your library's free streaming catalogue - hidden gems await.",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "They have many low-cost or donation-based concerts in some areas. Check your local event listings.",
        "mood": "calm",
        "weight": 1
      }
    ],
    "alert": [
      {
        "text": "Streaming subscriptions add up fast - check your auto-renewals and consider canceling one or two.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Buying games during emotional lows can lead to regret spending. Remember the 24-hour rule? Same applies here! Wait a day, then reassess. 🙂",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "Check your phone or card bill for microtransactions - they're sneaky and can pile up fast!",
        "mood": "motivated",
        "weight": 2
      }
    ]
  },
  "Transportation": {
    "celebrate": [
      {
        "text": "Bundle errands to cut down on fuel costs AND time!",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "Public transit can be a great way to cut transportation costs. Check your city's government website for rates on any weekly or monthly passes!",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Biking, scootering, or walking to errands? That's great! You're saving money *and* boosting your health. Great job! 🚶🚲🛴",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "You planned your week's drives in advance - that's budget-minded brilliance! 🦾",
        "mood": "calm",
        "weight": 4
      },
      {
        "text": "You skipped the drive and took the scenic route on foot. That's wellness and wealth working together.",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "Refueled during a discount window? Smart move!",
        "mood": "motivated",
        "weight": 2
      }
    ],
    "caution": [
      {
        "text": "I hear GasBuddy is a great mobile app to find the best low gas prices in your area. ⛽",
        "mood": "tired",
        "weight": 3
      },
      {
        "text": "Try carpooling with a friend or co-worker this week - one less drive, one more connection.",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "If you're using rideshare apps frequently, compare the cost to a monthly public transit pass. It may surprise you.",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "Track your gas fill-ups this month to see if you can cut down just a little. You can do this by keeping track of your distance and mileage. Awareness is step one.",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "Do you *need* to make that trip today, or can it wait a day to save mileage?",
        "mood": "motivated",
        "weight": 3
      }
    ],
    "alert": [
      {
        "text": "Have you checked the air on your tires lately? I know you may have a lot on your plate, but keeping up with routine vehicle maintenance saves costs on gas money and mileage in the long run.",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Regularly driving on empty gas tanks can damage your car and waste fuel. Keep it above 1/4 when you can.",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Ignoring strange car noises now can lead to expensive repairs later - budget for a checkup when possible.",
        "mood": "calm",
        "weight": 2
      }
    ]
  },
  "General": {
    "celebrate": [
      {
        "text": "Every dollar saved is 🦾 toward your top goal!",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Small swaps compound - great job noticing your habits.",
        "mood": "discouraged",
        "weight": 3
      },
      {
        "text": "Celebrate tiny wins; they pave the way for big change.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "You chose rest over retail therapy. That's emotional wealth.",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "You made a budget and actually *used it*. That's self-trust in action.",
        "mood": "tired",
        "weight": 4
      }
    ],
    "caution": [
      {
        "text": "Remember - you don't have to have it all figured out today.",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "Maybe transfer an extra $5 to the Emergency Fund? A cushion is never a bad thing to have!",
        "mood": "motivated",
        "weight": 1
      },
      {
        "text": "Don't let comparison pressure you into spending - you're doing great with what you have.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Tempted to throw the whole budget out the window? Pause. A reset is okay, but do not spiral.",
        "mood": "motivated",
        "weight": 3
      }
    ],
    "alert": [
      {
        "text": "Do not be afraid of your credit score! It can always be repaired.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Carrying a credit card balance means you're paying more for everything - try to pay in full if you can.",
        "mood": "tired",
        "weight": 1
      },
      {
        "text": "If you're feeling overwhelmed, pause and prioritize: essentials first, then progress.",
        "mood": "tired",
        "weight": 1
      }
    ]
  },
  "Shopping": {
    "celebrate": [
      {
        "text": "You found a great deal - and that's a win worth smiling about! 😃",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "Love that you waited for a sale instead of impulse-buying. That's progress!",
        "mood": "discouraged",
        "weight": 3
      },
      {
        "text": "You made a wishlist instead of checking out immediately - that's powerful restraint!",
        "mood": "calm",
        "weight": 4
      },
      {
        "text": "Window shopping without buying anything? Wow! That's a huge win for your budget awareness. Very proud of you. 🎯",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "You unsubscribed from a marketing email that kept tempting you - freedom!",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "You reused or repurposed something instead of buying new. Look at you - an eco-budget champion! ",
        "mood": "discouraged",
        "weight": 2
      }
    ],
    "caution": [
      {
        "text": "Try the 24-hour rule before buying non-essentials. More often that not, the urge passes.",
        "mood": "motivated",
        "weight": 1
      },
      {
        "text": "Do you really need to spend money on shopping, or are you soothing a feeling? No judgement however, be kind to yourself either way.",
        "mood": "discouraged",
        "weight": 3
      },
      {
        "text": "Everyone is guilty of impulse buying from time to time. Make sure you're keeping track of your spending habits that way you can continue to make progress in the future. Don't beat yourself up! 🙂",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Do not allow shopping apps and web sites urge you into spending money you don't have or to take advantage of deals before they expire. Brands are known to create a false sense of urgency to get consumers to spend more money at a faster rate. Don't let them win!",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "If it's not in the budget this month, bookmark it for later - not a no, just a *not-now*.",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Check your bank app *before* you shop to remind yourself what you're working with.",
        "mood": "calm",
        "weight": 3
      }
    ],
    "alert": [
      {
        "text": "Multiple unplanned purchases can hinder or derail your budget - deep breath, check your balance first.",
        "mood": "calm",
        "weight": 1
      },
      {
        "text": "If you're stress shopping, pause first and notice the trigger. You deserve peace, not pressure.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Store credit cards are one of the primary ways individuals go into debt. Be careful with opening up credit cards and never leave a balance!",
        "mood": "motivated",
        "weight": 2
      }
    ]
  },
  "Utilities": {
    "celebrate": [
      {
        "text": "You turned off the lights when leaving a room - tiny habit, real savings. Good job! 💡",
        "mood": "motivated",
        "weight": 3
      },
      {
        "text": "Lowering your thermostat by just 1-2 degrees is a mindful and money-smart decision! 🌡️",
        "mood": "calm",
        "weight": 2
      }
    ],
    "caution": [
      {
        "text": "Try running laundry at off-peak hours to cut energy costs. Your bill might thank you. 😉",
        "mood": "tired",
        "weight": 2
      },
      {
        "text": "Unplugging unused devices can reduce phantom energy drain. Worth checking! 🔌",
        "mood": "calm",
        "weight": 2
      }
    ],
    "alert": [
      {
        "text": "If your utility bill spiked this month, don't panic! Let's review usage and ask about budget billing options. ⚡",
        "mood": "discouraged",
        "weight": 2
      }
    ]
  },
  "Self-Care": {
    "celebrate": [
      {
        "text": "You took care of yourself *without* spending money today. That's radical self-love. 💚",
        "mood": "tired",
        "weight": 4
      },
      {
        "text": "Bubble bath with candles or incense instead of a shopping binge? That's a whole mood. 🛁",
        "mood": "discouraged",
        "weight": 3
      }
    ],
    "caution": [
      {
        "text": "It's okay to treat yourself, but let's plan for it. Self-care doesn't need to sabotage your budget.",
        "mood": "motivated",
        "weight": 3
      }
    ],
    "alert": [
      {
        "text": "If you're using spending as emotional escape, don't feel down on yourself. There's nothing wrong with you. Let's just pause and reflect before clicking 'Buy'.",
        "mood": "tired",
        "weight": 2
      }
    ]
  },
  "Medical": {
    "celebrate": [
      {
        "text": "You made that appointment you've been putting off. That's financial *and* physical wellness. Proud of you! 🙌",
        "mood": "discouraged",
        "weight": 3
      },
      {
        "text": "GoodRX is a great resource to find coupons for prescriptions. Keep those savings up anywhere you can! 🏪",
        "mood": "motivated",
        "weight": 3
      }
    ],
    "caution": [
      {
        "text": "Check if your local pharmacy offers a discount savings card - it could make your prescriptions more affordable.",
        "mood": "calm",
        "weight": 2
      }
    ],
    "alert": [
      {
        "text": "Avoiding medical care due to cost? Try calling the provider directly - some offer sliding scale or payment plans.",
        "mood": "tired",
        "weight": 2
      }
    ]
  },
  "Housing": {
    "celebrate": [
      {
        "text": "You stayed home and made it cozy instead of going out. That's mindful nesting AND budget-friendly. 🏡",
        "mood": "calm",
        "weight": 3
      }
    ],
    "caution": [
      {
        "text": "Rent feeling high this month? Let's see if we can trim elsewhere to protect your stability and peace of mind.",
        "mood": "tired",
        "weight": 2
      }
    ],
    "alert": [
      {
        "text": "If rent is more than 50% of your income, you're not alone. Let's make a gameplan while staying gentle with yourself.",
        "mood": "discouraged",
        "weight": 2
      }
    ]
  },
  "Debt": {
    "celebrate": [
      {
        "text": "You made a payment toward your debt today. Even a small amount counts - and it means you showed up for your future self. That's a win! 🦾",
        "mood": "discouraged",
        "weight": 4
      },
      {
        "text": "You looked at your balance today instead of avoiding it. That takes courage - and that's progress! 🦾",
        "mood": "tired",
        "weight": 4
      },
      {
        "text": "You said no to a new purchase so you could focus on improving your debt or avoiding it altogether. That's long-term thinking. Good job.",
        "mood": "motivated",
        "weight": 3
      }
    ],
    "caution": [
      {
        "text": "Let's review which of your debts has the highest interest rate - it might help you prioritize without overwhelming.",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "If your minimums feel too high, don't worry. You're not failing. We can make a plan to call the issuer to ask about hardship plans or pauses. It's always an option.",
        "mood": "tired",
        "weight": 3
      },
      {
        "text": "PSA: debt is NOT a moral failure! It's a system. Remember - your worth is not measured by your balance.",
        "mood": "discouraged",
        "weight": 4
      }
    ],
    "alert": [
      {
        "text": "If you're paying interest every month, your purchases are costing more than you think. Let's strategize what to tackle first.",
        "mood": "motivated",
        "weight": 3
      },
      {
        "text": "Avoiding payments or letters won't make them go away. I know they may be scary or overwhelming, but awareness is the first step to power.",
        "mood": "tired",
        "weight": 3
      },
      {
        "text": "If debt is keeping you up at night, you're not alone. But let's take one small action today: log in, breathe, and just look at the balance.",
        "mood": "discouraged",
        "weight": 4
      },
      {
        "text": "You deserve peace at every stage of your life, not just when you're debt-free. 💸",
        "mood": "discouraged",
        "weight": 4
      }
    ]
  },
  "Subscriptions": {
    "celebrate": [
      {
        "text": "Let's review your subscriptions for this month. Awareness is financial power. 🧠",
        "mood": "motivated",
        "weight": 4
      },
      {
        "text": "You canceled a service you weren't using anymore. That's clarity *and* cash flow! 😎",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "You downgraded a plan to better match your usage. Smart budgeting move! 🦾",
        "mood": "discouraged",
        "weight": 3
      }
    ],
    "caution": [
      {
        "text": "Let's scan your bank app or statements for any forgotten auto-renewals this week.",
        "mood": "tired",
        "weight": 3
      },
      {
        "text": "Before starting a new subscription, check if there's a free trial - and then set a cancel reminder. ⏳",
        "mood": "motivated",
        "weight": 2
      },
      {
        "text": "Are you stacking subscriptions again? Let's see which ones actually add value vs noise - and a hole in the pocket.",
        "mood": "calm",
        "weight": 3
      },
      {
        "text": "Regularly review your statements and app store for subscriptions. SaaS companies bank on you forgetting to cancel your free trials.",
        "mood": "motivated",
        "weight": 2
      } 
    ],
    "alert": [
      {
        "text": "You might be paying for tools you don't use anymore. Let's review your app store and card charges.",
        "mood": "calm",
        "weight": 2
      },
      {
        "text": "Be mindful of free trials auto-converting! It's easy to forget about them but those quiet charges can build up fast.",
        "mood": "discouraged",
        "weight": 2
      },
      {
        "text": "Subscription overload? Pause and ask yourself: does this spark clarity or add clutter to my life?",
        "mood": "tired",
        "weight": 2
      }
    ]
  }
}

