{
  "Groceries": [
    "Let's do a meal prep or batch-cook day this week.",
    "Let's check for any coupons or cheaper items at the local farmers market this week.",
    "Make a pantry-first recipe night - use what you already have!",
    "Uber Eats is cool, but have you ever tried cooking a delicious new recipe from your own kitchen? 😄"
  ],
  "Dining": [
    "How about we set a fun cook-at-home challenge tonight? It will pair beautifully with a lo-fi Spotify playlist! 🎧",
    "Let's swap one delivery for a picnic this week - same treat, half the cost!",
    "Set a max-spend rule for take-out this week and stick to it. 🦾",
    "Do your best to limit dining out, including Happy Hours. Those $5 apps and $7 cocktails add up! 🥂"
  ],
  "Entertainment": [
    "Browse your library's free streaming catalogue - hidden gems awat.",
    "We can make progress on an unfinished game instead of buying new games this month.",
    "They have many low-cost or donation-based concerts in some areas. Check your local event listings.",
    "You don't need to spend money to have fun. 🙂"
  ],
  "Transportation": [
    "I hear GasBuddy is a great mobile app to find the best low gas prices in your area.",
    "Bundle errands to cut down on fuel costs AND time!",
    "Public transit can be a great way to cut transportation costs. Check your city's government website for rates on any weekly or monthly passes!",
    "Have you checked the air on your tires lately? I know you may have a lot on your plate, but keeping up with routine vehicle maintenance saves costs on gas money and mileage in the long run."
  ],
  "General": [
    "Every dollar saved in 🦾 toward your top goal!",
    "Small swaps compound - great job noticing your habits.",
    "Celebrate tiny wins; they pave the way for big change.",
    "Remember - you don't have to have it all figured out today.",
    "Maybe transfer an extra $5 to the Emergency Fund? A cushion is never a bad thing to have!",
    "Do not be afraid of your credit score! It can always be repaired."
  ]
}

